soap/get_value.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <s:Header>
      <a:Action s:mustUnderstand="1">Retrieve</a:Action>

      <a:To s:mustUnderstand="1">https://mcrpqjd5819xdgb-q2vnx933qwj0.soap.marketingcloudapis.com/Service.asmx</a:To>
      <o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <o:UsernameToken u:Id="uuid-c10e3bda-13ef-4868-bacd-6e760cd45cf2-1">
            <o:Username>{{USERNAME}}</o:Username>
            <o:Password>{{PASSWORD}}</o:Password>
         </o:UsernameToken>
      </o:Security>
   </s:Header>
   <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<RetrieveRequestMsg xmlns="http://exacttarget.com/wsdl/partnerAPI">
 <RetrieveRequest>
    <ObjectType>DataExtensionObject[{{DATA_EXTENSION_NAME}}]</ObjectType>
    <Properties>{{PROPERTY}}</Properties>
    <Filter xsi:type="SimpleFilterPart">
       <Property>{{KEY}}</Property>
       <SimpleOperator>equals</SimpleOperator>
       <Value>{{FILTER_VALUE}}</Value>
    </Filter>
 </RetrieveRequest></RetrieveRequestMsg>
   </s:Body>
</s:Envelope>